uhnp/src/DataProcessors/ОтражениеЦессийВУчете/ОтражениеЦессийВУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОтражениеЦессийВУчете</name>
</mdclass:DataProcessor>

uhnp/src/InformationRegisters/ОтражениеЦессийВРегламентированномУчете/ОтражениеЦессийВРегламентированномУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтражениеЦессийВРегламентированномУчете</name>
  <resources>
    <name>Цессия</name>
    <type>
      <types>DocumentRef.ЦессияДолжника</types>
      <types>DocumentRef.ЦессияИсходящая</types>
      <types>DocumentRef.ЦессияВходящая</types>
    </type>
  </resources>
  <dimensions>
    <name>УчетныйДокумент</name>
    <type>
      <types>DocumentRef.ОперацияБух</types>
      <types>DocumentRef.ПрочиеДоходыРасходы</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.КорректировкаЗадолженностиПоФинансовымИнструментам</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.КорректировкаЗадолженности</types>
      <types>DocumentRef.ВзаимозачетЗадолженности</types>
      <types>DocumentRef.ЗаписьКнигиПродаж</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ВидыОбязательств/ВидыОбязательств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОбязательств</name>
  <enumValues>
    <name>ЗадолженностьПоДоговоруКуплиПродажи</name>
  </enumValues>
  <enumValues>
    <name>ЗадолженностьПоДоговоруЗайма</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыОперацийВзаимозачетаЗадолженности/ВидыОперацийВзаимозачетаЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийВзаимозачетаЗадолженности</name>
  <enumValues>
    <name>УдалитьКлиента</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПоставщика</name>
  </enumValues>
  <enumValues>
    <name>УдалитьМеждуКлиентами</name>
  </enumValues>
  <enumValues>
    <name>УдалитьМеждуПоставщиками</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКлиентаМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПоставщикаМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>Бартер</name>
  </enumValues>
  <enumValues>
    <name>Произвольный</name>
  </enumValues>
  <enumValues>
    <name>ПереносАвансаКлиентаОрганизацияКонтрагент</name>
  </enumValues>
  <enumValues>
    <name>ПереносАвансаКлиентаМеждуКонтрагентами</name>
  </enumValues>
  <enumValues>
    <name>ПереносАвансаКлиентаМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ПереносАвансаПоставщикуОрганизацияКонтрагент</name>
  </enumValues>
  <enumValues>
    <name>ПереносАвансаПоставщикуМеждуКонтрагентами</name>
  </enumValues>
  <enumValues>
    <name>ПереносАвансаПоставщикуМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ПереносДолгаКлиентаОрганизацияКонтрагент</name>
  </enumValues>
  <enumValues>
    <name>ПереносДолгаКлиентаМеждуКонтрагентами</name>
  </enumValues>
  <enumValues>
    <name>ПереносДолгаКлиентаМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ПереносДолгаПоставщикуОрганизацияКонтрагент</name>
  </enumValues>
  <enumValues>
    <name>ПереносДолгаПоставщикуМеждуКонтрагентами</name>
  </enumValues>
  <enumValues>
    <name>ПереносДолгаПоставщикуМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПодарочнымСертификатом</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеОплатыЧерезКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеВозвратаОплатыЧерезКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>ПереносАвансаКлиентаМеждуДвумяОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ПереносДолгаКлиентаМеждуДвумяОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ПереносАвансаПоставщикуМеждуДвумяОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ПереносДолгаПоставщикуМеждуДвумяОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>БартерМеждуОрганизациями</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ТипыУчастниковВзаимозачета/ТипыУчастниковВзаимозачета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУчастниковВзаимозачета</name>
  <enumValues>
    <name>Клиент</name>
  </enumValues>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>ОрганизацияКлиент</name>
  </enumValues>
  <enumValues>
    <name>ОрганизацияПоставщик</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ХарактерыДоговоровФинансовыхИнструментов/ХарактерыДоговоровФинансовыхИнструментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХарактерыДоговоровФинансовыхИнструментов</name>
  <enumValues>
    <name>КредитИлиЗайм</name>
  </enumValues>
  <enumValues>
    <name>Депозит</name>
  </enumValues>
  <enumValues>
    <name>ЗаймВыданный</name>
  </enumValues>
  <enumValues>
    <name>Аренда</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ТипыСуммГрафикаКредитовИДепозитов/ТипыСуммГрафикаКредитовИДепозитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСуммГрафикаКредитовИДепозитов</name>
  <enumValues>
    <name>ОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>Проценты</name>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ТипыРасчетовСПартнерами/ТипыРасчетовСПартнерами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРасчетовСПартнерами</name>
  <enumValues>
    <name>РасчетыСПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентом</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКредитором</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСДебитором</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСАрендодателем</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ЭлементыСтруктурыЗадолженности/ЭлементыСтруктурыЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭлементыСтруктурыЗадолженности</name>
  <enumValues>
    <name>ОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>Проценты</name>
  </enumValues>
  <enumValues>
    <name>Комиссии</name>
  </enumValues>
  <enumValues>
    <name>Штрафы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеКомиссии</name>
  </enumValues>
  <enumValues>
    <name>ВыкупнаяСтоимость</name>
  </enumValues>
  <enumValues>
    <name>ВыкупнаяСтоимостьАванс</name>
  </enumValues>
  <enumValues>
    <name>ОбеспечительныйПлатеж</name>
  </enumValues>
  <enumValues>
    <name>УслугаПоАренде</name>
  </enumValues>
  <enumValues>
    <name>ОсновнойДолгКонтрагента</name>
    <comment>Основной долг контрагента (используется для валютно-процентного свопа)</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыКонтрагента</name>
    <comment>Проценты контрагента (используется для валютно-процентного свопа)</comment>
  </enumValues>
  <enumValues>
    <name>УслугаПоАрендеАванс</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыЦенностей/ВидыЦенностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЦенностей</name>
  <enumValues>
    <name>АвансыВыданные</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученные</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученные0</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееПотребление</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>ВозвратАвансовПолученных</name>
  </enumValues>
  <enumValues>
    <name>ИмуществоСУчетомНДС</name>
  </enumValues>
  <enumValues>
    <name>КомандировочныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентАренда</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентРеализацияИмущества</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентИностранцы</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентЭлектронныеУслуги</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентКомитент</name>
  </enumValues>
  <enumValues>
    <name>НМА</name>
  </enumValues>
  <enumValues>
    <name>Оборудование</name>
  </enumValues>
  <enumValues>
    <name>ОбъектыНезавершенногоСтроительства</name>
  </enumValues>
  <enumValues>
    <name>ОС</name>
  </enumValues>
  <enumValues>
    <name>ПосредническиеУслуги</name>
  </enumValues>
  <enumValues>
    <name>ПредставительскиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРаботыИУслуги</name>
  </enumValues>
  <enumValues>
    <name>СМРПодрядные</name>
  </enumValues>
  <enumValues>
    <name>СМРСобственнымиСилами</name>
  </enumValues>
  <enumValues>
    <name>СуммыСвязанныеСРасчетамиПоОплате</name>
  </enumValues>
  <enumValues>
    <name>ТаможенныеПлатежи</name>
  </enumValues>
  <enumValues>
    <name>ТаможенныеПлатежиОС</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ТаможенныйСоюз</name>
  </enumValues>
  <enumValues>
    <name>ТоварыНалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>АвансыВыданныеНалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученныеНалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>ВозвратАвансовПолученныхНалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеУслуги</name>
  </enumValues>
  <enumValues>
    <name>УслугиНеНаТерриторииРФ</name>
  </enumValues>
  <enumValues>
    <name>ВосстановлениеПоКСФ</name>
  </enumValues>
  <enumValues>
    <name>РеверсивноеОбложениеНДС</name>
  </enumValues>
  <enumValues>
    <name>ТоварыФизлицамВЕАЭСЭлектронныеПлощадки</name>
  </enumValues>
  <enumValues>
    <name>СМРПодрядныеКапстроительство</name>
  </enumValues>
  <enumValues>
    <name>КапстроительствоНезавершенныхОбъектов</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/DataProcessors/ОтражениеЦессийВУчете/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.Источник)
		ИЛИ НЕ ЗначениеЗаполнено(Параметры.ВидОбязательства) Тогда
			
		ВызватьИсключение НСтр("ru = 'Предусмотрено открытие обработки только из документов';
								|en = 'Data processor can be opened only from documents'");
	КонецЕсли;
	Цессия 			= Параметры.Источник;   
	ТипЦессии 		= ТипЗнч(Цессия); 
	ЭтоДолжник		= ТипЦессии = Тип("ДокументСсылка.ЦессияДолжника");
	ЭтоЦессионарий 	= ТипЦессии = Тип("ДокументСсылка.ЦессияВходящая");
	ЭтоЦедент	 	= ТипЦессии = Тип("ДокументСсылка.ЦессияИсходящая");
		        
	ВидОбязательства    = Параметры.ВидОбязательства;
	ЭтоЗаем				= ВидОбязательства = Перечисления.ВидыОбязательств.ЗадолженностьПоДоговоруЗайма;
	ЗаполнитьРеквизиты();
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КорректировкаДолгаДолжник(Команда) 

	Если ЗначениеЗаполнено(КорректировкаДолжник) Тогда
		ПоказатьЗначение(,КорректировкаДолжник);
	Иначе	
		СоздатьКорректировкуДолгаДолжник();
		УправлениеФормой();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КорректировкаДолжникФИКредит(Команда)

	Если ЗначениеЗаполнено(КорректировкаДолжникФИКредит) Тогда
		ПоказатьЗначение(,КорректировкаДолжникФИКредит);
	Иначе	
		СоздатьКорректировкаДолжникФИКредит();
		УправлениеФормой();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеЦессионарий(Команда) 
	
	Если ЗначениеЗаполнено(ПоступлениеЦессионарий) Тогда
		ПоказатьЗначение(,ПоступлениеЦессионарий);
	Иначе	
		СоздатьПоступлениеЦессионарий();
		УправлениеФормой();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаЗадолженностиЦедент(Команда)
	
	Если ЗначениеЗаполнено(КорректировкаЗадолженности) Тогда
		ПоказатьЗначение(,КорректировкаЗадолженности);
	Иначе	
		СоздатьКорректировкаЗадолженностиЦедент();
		УправлениеФормой();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеДоходыРасходыЦедент(Команда)

	Если ЗначениеЗаполнено(ПрочиеДоходыРасходыЦедент) Тогда
		ПоказатьЗначение(,ПрочиеДоходыРасходыЦедент);
	Иначе	
		СоздатьПрочиеДоходыРасходыЦедент();
		УправлениеФормой();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура КорректировкаФИЦедент(Команда)
  
	Если ЗначениеЗаполнено(КорректировкаЦедентФИ) Тогда
		ПоказатьЗначение(,КорректировкаЦедентФИ);
	Иначе	
		СоздатьКорректировкаФИЦедент();
		УправлениеФормой();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Перезаполнить(Команда)
	ПерезаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	
	Если ЭтоДолжник Тогда 
		Если НЕ ЗначениеЗаполнено(КорректировкаДолжникФИДебет) Тогда
			СоздатьКорректировкаДолжникФИДебет();	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(КорректировкаДолжникФИКредит) Тогда
			СоздатьКорректировкаДолжникФИКредит();	
		КонецЕсли;
		
	КонецЕсли;	
			
		
	Если ЭтоЦедент И НЕ ЭтоЗаем Тогда
		Если НЕ ЗначениеЗаполнено(ПрочиеДоходыРасходыЦедент) Тогда
			СоздатьПрочиеДоходыРасходыЦедент();	
		КонецЕсли;
				
		Если НЕ ЗначениеЗаполнено(КорректировкаЗадолженности) Тогда
			СоздатьКорректировкаЗадолженностиЦедент();
		КонецЕсли;                   
	ИначеЕсли ЭтоЦедент Тогда	
		
		Если НЕ ЗначениеЗаполнено(ПрочиеДоходыРасходыЦедентЗаем) Тогда
			СоздатьПрочиеДоходыРасходыЦедентЗаем();	
		КонецЕсли;   
		Если НЕ ЗначениеЗаполнено(КорректировкаЦедентФИ) Тогда
			СоздатьКорректировкаФИЦедент();	
		КонецЕсли;   
		Если НЕ ЗначениеЗаполнено(РеализацияЦедент) Тогда
			СоздатьРеализацияЦедент();	
		КонецЕсли;   
	
	КонецЕсли;     

	Если ЭтоЦессионарий И НЕ ЭтоЗаем Тогда
		
		Если НЕ ЗначениеЗаполнено(ПоступлениеЦессионарий) Тогда
			СоздатьПоступлениеЦессионарий();
		КонецЕсли; 
		Если НЕ ЗначениеЗаполнено(ПрочиеДоходыРасходыЦессионарий) Тогда
			СоздатьПрочиеДоходыРасходыЦессионарий();
		КонецЕсли;  
		Если НЕ ЗначениеЗаполнено(ЗаписьКнигиПродажЦессионарийПоставка) Тогда
			СоздатьЗаписьКнигиПродажЦессионарийПоставка();
		КонецЕсли;  
	ИначеЕсли ЭтоЦессионарий Тогда
		
		Если НЕ ЗначениеЗаполнено(ПоступлениеЦессионарийЗаем) Тогда
			СоздатьПоступлениеЦессионарийЗаем();
		КонецЕсли; 
		Если НЕ ЗначениеЗаполнено(КорректировкаЦессионарийФИ) Тогда
			СоздатьКорректировкаЗадолженностиФИЦессионарий();
		КонецЕсли;  
		Если НЕ ЗначениеЗаполнено(ПрочиеДоходыРасходыЦессионарийЗаем) Тогда
			СоздатьПрочиеДоходыРасходыЦессионарийЗаем();
		КонецЕсли;   
		Если НЕ ЗначениеЗаполнено(ЗаписьКнигиПродажЦессионарийЗаем) Тогда
			СоздатьЗаписьКнигиПродажЦессионарийЗаем();
		КонецЕсли; 

	КонецЕсли;

	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаДолжникФИДебет(Команда)

	Если ЗначениеЗаполнено(КорректировкаДолжникФИДебет) Тогда
		ПоказатьЗначение(,КорректировкаДолжникФИДебет);
	Иначе	
		СоздатьКорректировкаДолжникФИДебет();
		УправлениеФормой();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрочиеДоходыРасходыЦессионарий(Команда)
	
	Если ЗначениеЗаполнено(ПрочиеДоходыРасходыЦессионарий) Тогда
		ПоказатьЗначение(,ПрочиеДоходыРасходыЦессионарий);
	Иначе	
		СоздатьПрочиеДоходыРасходыЦессионарий();
		УправлениеФормой();
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаЗадолженностиФИЦессионарий(Команда)
	
	Если ЗначениеЗаполнено(КорректировкаЦессионарийФИ) Тогда
		ПоказатьЗначение(,КорректировкаЦессионарийФИ);
	Иначе	
		СоздатьКорректировкаЗадолженностиФИЦессионарий();
		УправлениеФормой();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписьКнигиПродажЦессионарийПоставка(Команда)

	Если ЗначениеЗаполнено(ЗаписьКнигиПродажЦессионарийПоставка) Тогда
		ПоказатьЗначение(,ЗаписьКнигиПродажЦессионарийПоставка);
	Иначе	
		СоздатьЗаписьКнигиПродажЦессионарийПоставка();
		УправлениеФормой();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеЦессионарийЗаем(Команда)

	Если ЗначениеЗаполнено(ПоступлениеЦессионарийЗаем) Тогда
		ПоказатьЗначение(, ПоступлениеЦессионарийЗаем);
	Иначе	
		СоздатьПоступлениеЦессионарийЗаем();
		УправлениеФормой();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РеализацияЦедент(Команда)

	Если ЗначениеЗаполнено(РеализацияЦедент) Тогда
		ПоказатьЗначение(, РеализацияЦедент);
	Иначе	
		СоздатьРеализацияЦедент();
		УправлениеФормой();
	КонецЕсли;
КонецПроцедуры    

&НаКлиенте
Процедура ПрочиеДоходыРасходыЦессионарийЗаем(Команда)

	Если ЗначениеЗаполнено(ПрочиеДоходыРасходыЦессионарийЗаем) Тогда
		ПоказатьЗначение(,ПрочиеДоходыРасходыЦессионарийЗаем);
	Иначе	
		СоздатьПрочиеДоходыРасходыЦессионарийЗаем();
		УправлениеФормой();
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписьКнигиПродажЦессионарийЗаем(Команда)

	Если ЗначениеЗаполнено(ЗаписьКнигиПродажЦессионарийЗаем) Тогда
		ПоказатьЗначение(, ЗаписьКнигиПродажЦессионарийЗаем);
	Иначе	
		СоздатьЗаписьКнигиПродажЦессионарийЗаем();
		УправлениеФормой();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрочиеДоходыРасходыЦедентЗаем(Команда)

	Если ЗначениеЗаполнено(ПрочиеДоходыРасходыЦедентЗаем) Тогда
		ПоказатьЗначение(,ПрочиеДоходыРасходыЦедентЗаем);
	Иначе	
		СоздатьПрочиеДоходыРасходыЦедентЗаем();
		УправлениеФормой();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()  
	
	ЭтоЦессияВходящая 	= ТипЗнч(Цессия) = Тип("ДокументСсылка.ЦессияВходящая");
	ЭтоЦессияДолжника 	= ТипЗнч(Цессия) = Тип("ДокументСсылка.ЦессияДолжника");
	ЭтоЦессияИсходящая 	= ТипЗнч(Цессия) = Тип("ДокументСсылка.ЦессияИсходящая");
	
	Элементы.ГруппаДолжник.Видимость 		= ЭтоЦессияДолжника;
	Элементы.ГруппаЦедент.Видимость 		= ЭтоЦессияИсходящая;
	Элементы.ГруппаЦессионарий.Видимость 	= ЭтоЦессияВходящая;
	
    Элементы.СобытиеДолжникаЗаем.Видимость    	= ЭтоЗаем;
	Элементы.СобытиеДолжникПоставки.Видимость 	= НЕ ЭтоЗаем; 
	
	Элементы.СобытиеЦедентЗаем.Видимость    	= ЭтоЗаем;
	Элементы.СобытиеЦедентПоставки.Видимость 	= НЕ ЭтоЗаем;     
	
	Элементы.СобытиеЦессионарийЗаем.Видимость	  	= ЭтоЗаем;
	Элементы.СобытиеЦессионарийПоставки.Видимость 	= НЕ ЭтоЗаем; 

	
	Если ЗначениеЗаполнено(ПоступлениеЦессионарий) Тогда
		Элементы.ПоступлениеЦессионарий.Заголовок = СтрШаблон(НСтр("ru = '%1'"), ПоступлениеЦессионарий);
	Иначе
		Элементы.ПоступлениеЦессионарий.Заголовок = НСтр("ru = '<Создать документ поступления>'");
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(КорректировкаДолжникФИКредит) Тогда
		Элементы.КорректировкаДолжникФИКредит.Заголовок = СтрШаблон(НСтр("ru = '%1'"), КорректировкаДолжникФИКредит);
	Иначе
		Элементы.КорректировкаДолжникФИКредит.Заголовок = НСтр("ru = '<Создать корректировку задолженности по ФИ по Кт>'");
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(КорректировкаДолжникФИДебет) Тогда
		Элементы.КорректировкаДолжникФИДебет.Заголовок = СтрШаблон(НСтр("ru = '%1'"), КорректировкаДолжникФИДебет);
	Иначе
		Элементы.КорректировкаДолжникФИДебет.Заголовок = НСтр("ru = '<Создать корректировку задолженности по ФИ по Дт>'");
	КонецЕсли;   
	
	Если ЗначениеЗаполнено(КорректировкаДолжник) Тогда
		Элементы.КорректировкаДолгаДолжник.Заголовок = СтрШаблон(НСтр("ru = '%1'"), КорректировкаДолжник);
	Иначе
		Элементы.КорректировкаДолгаДолжник.Заголовок = НСтр("ru = '<Создать корректировку долга>'");
	КонецЕсли; 
	
	// Цедент
	Если ЗначениеЗаполнено(КорректировкаЗадолженности) Тогда
		Элементы.КорректировкаЗадолженностиЦедент.Заголовок = СтрШаблон(НСтр("ru = '%1'"), КорректировкаЗадолженности);
	Иначе
		Элементы.КорректировкаЗадолженностиЦедент.Заголовок = НСтр("ru = '<Создать списание задолженности>'");
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(ПрочиеДоходыРасходыЦедент) Тогда
		Элементы.ПрочиеДоходыРасходыЦедент.Заголовок = СтрШаблон(НСтр("ru = '%1'"), ПрочиеДоходыРасходыЦедент);
	Иначе
		Элементы.ПрочиеДоходыРасходыЦедент.Заголовок = НСтр("ru = '<Создать регистрацию доходов/расходов>'");
	КонецЕсли; 

	Если ЗначениеЗаполнено(ПрочиеДоходыРасходыЦедентЗаем) Тогда
		Элементы.ПрочиеДоходыРасходыЦедентЗаем.Заголовок = СтрШаблон(НСтр("ru = '%1'"), ПрочиеДоходыРасходыЦедентЗаем);
	Иначе
		Элементы.ПрочиеДоходыРасходыЦедентЗаем.Заголовок = НСтр("ru = '<Создать регистрацию доходов/расходов>'");
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(РеализацияЦедент) Тогда
		Элементы.РеализацияЦедент.Заголовок = СтрШаблон(НСтр("ru = '%1'"), РеализацияЦедент);
	Иначе
		Элементы.РеализацияЦедент.Заголовок = НСтр("ru = '<Создать реализацию>'");
	КонецЕсли; 
			
	Если ЗначениеЗаполнено(КорректировкаЦедентФИ) Тогда
		Элементы.КорректировкаФИЦедент.Заголовок = СтрШаблон(НСтр("ru = '%1'"), КорректировкаЦедентФИ);
	Иначе
		Элементы.КорректировкаФИЦедент.Заголовок = НСтр("ru = '<Создать корректировку задолженности>'");
	КонецЕсли; 
	
	// Цессионарий
	Если ЗначениеЗаполнено(ПрочиеДоходыРасходыЦессионарий) Тогда
		Элементы.ПрочиеДоходыРасходыЦессионарий.Заголовок = СтрШаблон(НСтр("ru = '%1'"), ПрочиеДоходыРасходыЦессионарий);
	Иначе
		Элементы.ПрочиеДоходыРасходыЦессионарий.Заголовок = НСтр("ru = '<Создать регистрацию доходов/расходов>'");
	КонецЕсли;   
	
	Если ЗначениеЗаполнено(ПрочиеДоходыРасходыЦессионарийЗаем) Тогда
		Элементы.ПрочиеДоходыРасходыЦессионарийЗаем.Заголовок = СтрШаблон(НСтр("ru = '%1'"), ПрочиеДоходыРасходыЦессионарийЗаем);
	Иначе
		Элементы.ПрочиеДоходыРасходыЦессионарийЗаем.Заголовок = НСтр("ru = '<Создать регистрацию доходов/расходов>'");
	КонецЕсли;   
	
	Если ЗначениеЗаполнено(КорректировкаЦессионарийФИ) Тогда
		Элементы.КорректировкаЗадолженностиФИЦессионарий.Заголовок = СтрШаблон(НСтр("ru = '%1'"), КорректировкаЦессионарийФИ);
	Иначе
		Элементы.КорректировкаЗадолженностиФИЦессионарий.Заголовок = НСтр("ru = '<Создать корректировку задолженности>'");
	КонецЕсли;    
		
	Если ЗначениеЗаполнено(ЗаписьКнигиПродажЦессионарийПоставка) Тогда
		Элементы.ЗаписьКнигиПродажЦессионарийПоставка.Заголовок = СтрШаблон(НСтр("ru = '%1'"), ЗаписьКнигиПродажЦессионарийПоставка);
	Иначе
		Элементы.ЗаписьКнигиПродажЦессионарийПоставка.Заголовок = НСтр("ru = '<Создать запись книги продаж>'");
	КонецЕсли;    
	
	Если ЗначениеЗаполнено(ЗаписьКнигиПродажЦессионарийЗаем) Тогда
		Элементы.ЗаписьКнигиПродажЦессионарийЗаем.Заголовок = СтрШаблон(НСтр("ru = '%1'"), ЗаписьКнигиПродажЦессионарийЗаем);
	Иначе
		Элементы.ЗаписьКнигиПродажЦессионарийЗаем.Заголовок = НСтр("ru = '<Создать запись книги продаж>'");
	КонецЕсли;  
	Если ЗначениеЗаполнено(ПоступлениеЦессионарий) Тогда
		Элементы.ПоступлениеЦессионарий.Заголовок = СтрШаблон(НСтр("ru = '%1'"), ПоступлениеЦессионарий);
	Иначе
		Элементы.ПоступлениеЦессионарий.Заголовок = НСтр("ru = '<Создать поступление>'");
	КонецЕсли;   
	
	Если ЗначениеЗаполнено(ПоступлениеЦессионарийЗаем) Тогда
		Элементы.ПоступлениеЦессионарийЗаем.Заголовок = СтрШаблон(НСтр("ru = '%1'"), ПоступлениеЦессионарийЗаем);
	Иначе
		Элементы.ПоступлениеЦессионарийЗаем.Заголовок = НСтр("ru = '<Создать поступление>'");
	КонецЕсли;   
	
	Элементы.ФормаСоздатьДокументы.Видимость =  НЕ (ЭтоДолжник И НЕ ЭтоЗаем);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКорректировкуДолгаДолжник()
	
	СтруктураРеквизитов = ЦессииУХ.РеквизитыДолжник();   
	
	РеквизитыЦессии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Цессия, СтруктураРеквизитов);

	/// ++
	Если ЗначениеЗаполнено(КорректировкаДолжник) Тогда
    	ДокументОбъект = КорректировкаДолжник.ПолучитьОбъект();
	Иначе
		ДокументОбъект = Документы.ВзаимозачетЗадолженности.СоздатьДокумент();
	КонецЕсли;    
	ДокументОбъект = Документы.ВзаимозачетЗадолженности.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	//ДокументОбъект.ДокументОснование = Документ;
	
	ДокументОбъект.Комментарий = НСтр("ru = 'Сформирован автоматически при отражении в учете цессии '");
	
	ДокументОбъект.КонтрагентКредитор = РеквизитыЦессии.Цедент;
	ДокументОбъект.КонтрагентДебитор  = РеквизитыЦессии.Цессионарий;
	
	ДокументОбъект.ВидОперации 		= Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаПоставщикуМеждуКонтрагентами;
	ДокументОбъект.Организация    	= РеквизитыЦессии.Организация;
	ДокументОбъект.Валюта			= РеквизитыЦессии.ВалютаДокумента;
	
	ДокументОбъект.ТипДебитора        = Перечисления.ТипыУчастниковВзаимозачета.Поставщик;
	ДокументОбъект.ТипКредитора       = Перечисления.ТипыУчастниковВзаимозачета.Поставщик;
	ДокументОбъект.СуммаРегл          = РеквизитыЦессии.СуммаДокумента;
	ДокументОбъект.СуммаУпр           = РеквизитыЦессии.СуммаДокумента;
	
	ДокументОбъект.ДебиторскаяЗадолженность.Очистить();
	ДокументОбъект.КредиторскаяЗадолженность.Очистить();
	
	СтрокаАванса = ДокументОбъект.ДебиторскаяЗадолженность.Добавить();
	
	СтрокаАванса.Организация          = РеквизитыЦессии.Организация;
	СтрокаАванса.Партнер              = РеквизитыЦессии.ПартнерЦессионарий;
	СтрокаАванса.ОбъектРасчетов       = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(РеквизитыЦессии.ДоговорСЦессионарием);
	СтрокаАванса.ВалютаВзаиморасчетов = РеквизитыЦессии.ВалютаДокумента;
	СтрокаАванса.СуммаВзаиморасчетов  = РеквизитыЦессии.СуммаДокумента;
	СтрокаАванса.СуммаРегл            = РеквизитыЦессии.СуммаДокумента;
	СтрокаАванса.СуммаУпр             = РеквизитыЦессии.СуммаДокумента;
	
	СтрокаЗачета = ДокументОбъект.КредиторскаяЗадолженность.Добавить();  
	СтрокаЗачета.Партнер              = РеквизитыЦессии.ПартнерЦедент;
	СтрокаЗачета.ОбъектРасчетов       = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(РеквизитыЦессии.ДоговорСЦедентом);
	СтрокаЗачета.ВалютаВзаиморасчетов = РеквизитыЦессии.ВалютаДокумента;
	СтрокаЗачета.СуммаВзаиморасчетов = РеквизитыЦессии.СуммаДокумента;
	СтрокаЗачета.СуммаРегл           = РеквизитыЦессии.СуммаДокумента;
	СтрокаЗачета.СуммаУпр            = РеквизитыЦессии.СуммаДокумента;

	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);

	КорректировкаДолжник = ДокументОбъект.Ссылка;  
	ЗаписатьОтражениеЦессийВРегламентированномУчете(ДокументОбъект.Ссылка)

КонецПроцедуры  

&НаСервере
Процедура ЗаписатьОтражениеЦессийВРегламентированномУчете(ДокументРегУчета)
	
	МенеджерЗаписи = РегистрыСведений.ОтражениеЦессийВРегламентированномУчете.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УчетныйДокумент 	= ДокументРегУчета;
	МенеджерЗаписи.Цессия			= Цессия;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизиты()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтражениеЦессийВРегламентированномУчете.УчетныйДокумент КАК УчетныйДокумент,
		|	ОтражениеЦессийВРегламентированномУчете.Цессия КАК Цессия,
		|	ЕСТЬNULL(ОтражениеЦессийВРегламентированномУчете.УчетныйДокумент.ХозяйственнаяОперация, НЕОПРЕДЕЛЕНО) КАК ХозяйственнаяОперация
		|ИЗ
		|	РегистрСведений.ОтражениеЦессийВРегламентированномУчете КАК ОтражениеЦессийВРегламентированномУчете
		|ГДЕ
		|	ОтражениеЦессийВРегламентированномУчете.Цессия = &Цессия";
	
	Запрос.УстановитьПараметр("Цессия", Цессия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЭтоДолжник
				И ТипЗнч(ВыборкаДетальныеЗаписи.УчетныйДокумент) = ТИП("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
		
			КорректировкаДолжник = ВыборкаДетальныеЗаписи.УчетныйДокумент;
				
		КонецЕсли;  
		
		// КорректировкаДолжникФИКредит
		
		Если ЭтоДолжник И ТипЗнч(ВыборкаДетальныеЗаписи.УчетныйДокумент) = ТИП("ДокументСсылка.КорректировкаЗадолженностиПоФинансовымИнструментам") 
			 Тогда                                                                                                                    
		    Если ВыборкаДетальныеЗаписи.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности  Тогда
				КорректировкаДолжникФИКредит = ВыборкаДетальныеЗаписи.УчетныйДокумент;
			Иначе
				КорректировкаДолжникФИДебет  = ВыборкаДетальныеЗаписи.УчетныйДокумент;
			КонецЕсли;				
		КонецЕсли;  
	
		Если ЭтоЦессионарий И НЕ ЭтоЗаем
				И ТипЗнч(ВыборкаДетальныеЗаписи.УчетныйДокумент) = ТИП("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда
			ПоступлениеЦессионарий = ВыборкаДетальныеЗаписи.УчетныйДокумент;
		КонецЕсли;  
		
		Если ЭтоЦессионарий И ЭтоЗаем
				И ТипЗнч(ВыборкаДетальныеЗаписи.УчетныйДокумент) = ТИП("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда
			ПоступлениеЦессионарийЗаем = ВыборкаДетальныеЗаписи.УчетныйДокумент;
		КонецЕсли;  
		
		Если ЭтоЦессионарий
				И ТипЗнч(ВыборкаДетальныеЗаписи.УчетныйДокумент) = ТИП("ДокументСсылка.КорректировкаЗадолженностиПоФинансовымИнструментам") Тогда
			КорректировкаЦессионарийФИ = ВыборкаДетальныеЗаписи.УчетныйДокумент;
		КонецЕсли;   
		
		Если ЭтоЦессионарий  И НЕ ЭтоЗаем
			И ТипЗнч(ВыборкаДетальныеЗаписи.УчетныйДокумент) = ТИП("ДокументСсылка.ЗаписьКнигиПродаж") Тогда
			ЗаписьКнигиПродажЦессионарийПоставка = ВыборкаДетальныеЗаписи.УчетныйДокумент;
		КонецЕсли; 
		
		Если ЭтоЦессионарий И НЕ ЭтоЗаем
				И ТипЗнч(ВыборкаДетальныеЗаписи.УчетныйДокумент) = ТИП("ДокументСсылка.ПрочиеДоходыРасходы") Тогда
			ПрочиеДоходыРасходыЦессионарий = ВыборкаДетальныеЗаписи.УчетныйДокумент;
		КонецЕсли;  
		
		Если ЭтоЦессионарий И ЭтоЗаем
				И ТипЗнч(ВыборкаДетальныеЗаписи.УчетныйДокумент) = ТИП("ДокументСсылка.ПрочиеДоходыРасходы") Тогда
			ПрочиеДоходыРасходыЦессионарийЗаем = ВыборкаДетальныеЗаписи.УчетныйДокумент;
		КонецЕсли;  
		
		Если ЭтоЦессионарий И ЭтоЗаем
				И ТипЗнч(ВыборкаДетальныеЗаписи.УчетныйДокумент) = ТИП("ДокументСсылка.ЗаписьКнигиПродаж") Тогда
			ЗаписьКнигиПродажЦессионарийЗаем = ВыборкаДетальныеЗаписи.УчетныйДокумент;
		КонецЕсли;  
		
		// Цедент
		Если ЭтоЦедент
				И ТипЗнч(ВыборкаДетальныеЗаписи.УчетныйДокумент) = ТИП("ДокументСсылка.ПрочиеДоходыРасходы") Тогда
			ПрочиеДоходыРасходыЦедент = ВыборкаДетальныеЗаписи.УчетныйДокумент;
		КонецЕсли;  
		Если ЭтоЦедент И ЭтоЗаем
				И ТипЗнч(ВыборкаДетальныеЗаписи.УчетныйДокумент) = ТИП("ДокументСсылка.ПрочиеДоходыРасходы") Тогда
			ПрочиеДоходыРасходыЦедентЗаем = ВыборкаДетальныеЗаписи.УчетныйДокумент;
		КонецЕсли; 
		Если ЭтоЦедент
				И ТипЗнч(ВыборкаДетальныеЗаписи.УчетныйДокумент) = ТИП("ДокументСсылка.РеализацияУслугПрочихАктивов") Тогда
			РеализацияЦедент = ВыборкаДетальныеЗаписи.УчетныйДокумент;
		КонецЕсли;
		
		Если ЭтоЦедент
				И ТипЗнч(ВыборкаДетальныеЗаписи.УчетныйДокумент) = ТИП("ДокументСсылка.КорректировкаЗадолженности") Тогда
			КорректировкаЗадолженности = ВыборкаДетальныеЗаписи.УчетныйДокумент;
		КонецЕсли;
		
		Если ЭтоЦедент
				И ТипЗнч(ВыборкаДетальныеЗаписи.УчетныйДокумент) = ТИП("ДокументСсылка.КорректировкаЗадолженностиПоФинансовымИнструментам") Тогда
			КорректировкаЦедентФИ = ВыборкаДетальныеЗаписи.УчетныйДокумент;
		КонецЕсли; 
		
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СоздатьКорректировкаДолжникФИКредит()
	
	СтруктураРеквизитов = ЦессииУх.РеквизитыДолжник();
	РеквизитыЦессии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Цессия, СтруктураРеквизитов);
	
	СуммаОсновногоДолга = СуммаОсновногоДолгаЦессииДолжника();
    СуммаПроцентов 		= РеквизитыЦессии.СуммаДокумента - СуммаОсновногоДолга;

	Если ЗначениеЗаполнено(КорректировкаДолжникФИКредит) Тогда
    	ДокументОбъект 			= КорректировкаДолжникФИКредит.ПолучитьОбъект();
	Иначе
		ДокументОбъект 			= Документы.КорректировкаЗадолженностиПоФинансовымИнструментам.СоздатьДокумент();	
	КонецЕсли;
	ДокументОбъект.Организация 	= РеквизитыЦессии.Организация; 
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Дата) Тогда 
		ДокументОбъект.Дата 		= ТекущаяДатаСеанса();
	КонецЕсли;	
	ДокументОбъект.Комментарий 	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Регл учет по документу: %1'"), Цессия);
	ДокументОбъект.Автор		= Пользователи.ТекущийПользователь();
	ДокументОбъект.Договор		= РеквизитыЦессии.ДоговорСЦедентом;
	ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности;
	ДокументОбъект.ХарактерДоговора		 = Перечисления.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм;
	ДокументОбъект.Контрагент 	= РеквизитыЦессии.Цедент;
	ДокументОбъект.Партнер	 	= РеквизитыЦессии.ПартнерЦедент;
	ДокументОбъект.СтатьяДоходов = Константы.СтатьяОтраженияЦессии.Получить();
	
	ДокументОбъект.Задолженность.Очистить();
	СтрокаЗадолженности = ДокументОбъект.Задолженность.Добавить();
	СтрокаЗадолженности.ТипСуммы 	= Перечисления.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг;
	СтрокаЗадолженности.Сумма 		= РеквизитыЦессии.СуммаДокумента;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);   
	КорректировкаДолжникФИКредит = ДокументОбъект.Ссылка;
	ЗаписатьОтражениеЦессийВРегламентированномУчете(ДокументОбъект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура СоздатьКорректировкаЗадолженностиЦедент()
	
	СтруктураРеквизитов = ЦессииУХ.РеквизитыЦедент();
	РеквизитыЦессии 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Цессия, СтруктураРеквизитов);
	
	Если ЗначениеЗаполнено(КорректировкаЗадолженности) Тогда
        ДокументОбъект = КорректировкаЗадолженности.ПолучитьОбъект();
	Иначе
		ДокументОбъект = Документы.КорректировкаЗадолженности.СоздатьДокумент();		
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Дата) Тогда
		ДокументОбъект.Дата			= ТекущаяДатаСеанса();
	КонецЕсли;
	ДокументОбъект.Автор 			= Пользователи.ТекущийПользователь(); 
	ДокументОбъект.Контрагент		= РеквизитыЦессии.Должник;
	ДокументОбъект.Организация		= РеквизитыЦессии.Организация;
	ДокументОбъект.ХозяйственнаяОперация			= Перечисления.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности;
	
	ДокументОбъект.Задолженность.Очистить();
	СтрокаЗадолженности = ДокументОбъект.Задолженность.Добавить();
	СтрокаЗадолженности.Партнер			= РеквизитыЦессии.ПартнерДолжник;
	СтрокаЗадолженности.ОбъектРасчетов	= ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(РеквизитыЦессии.ДоговорДолжника);
	СтрокаЗадолженности.ТипРасчетов		= Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	СтрокаЗадолженности.Сумма			= РеквизитыЦессии.СуммаДокумента; 
	СтрокаЗадолженности.ВалютаВзаиморасчетов = РеквизитыЦессии.ВалютаДокумента;
	
	ДокументОбъект.ДоходыРасходыАктивыПассивы.Очистить();
	
	СтрокаАктивы = ДокументОбъект.ДоходыРасходыАктивыПассивы.Добавить();
	СтрокаАктивы.Статья = Константы.СтатьяОтраженияЦессии.Получить();
	НоваяНастройка = НастройкаСчетовУчетаКлиентСервер.СоставНастройкиСчетовУчета();
	НоваяНастройка.СчетУчета = ПланыСчетов.Хозрасчетный.ПрочиеРасходы;
	НоваяНастройка.Субконто1 = Константы.СтатьяРасходовЦессии.Получить();
		
	СтрокаАктивы.НастройкаСчетовУчета = НастройкаСчетовУчетаСервер.НоваяНастройкаСчетовУчета(НоваяНастройка);


	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);  

	КорректировкаЗадолженности	= ДокументОбъект.Ссылка;
	ЗаписатьОтражениеЦессийВРегламентированномУчете(ДокументОбъект.Ссылка)
    
КонецПроцедуры

&НаСервере
Процедура СоздатьПрочиеДоходыРасходыЦедент()

	СтруктураРеквизитов = ЦессииУХ.РеквизитыЦедент(); 
		
	РеквизитыЦессии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Цессия, СтруктураРеквизитов);
	
    СуммаПремии 	= РеквизитыЦессии.СуммаДокумента - РеквизитыЦессии.СуммаОбязательства;
	ЭтоДоход 		= СуммаПремии>0;   
	Если НЕ  ЭтоДоход Тогда
	    СуммаПремии	= - СуммаПремии;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПрочиеДоходыРасходыЦедент) Тогда
    	ДокументОбъект 				= ПрочиеДоходыРасходыЦедент.ПолучитьОбъект();
	Иначе
		ДокументОбъект 				= Документы.ПрочиеДоходыРасходы.СоздатьДокумент();	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Дата ) Тогда
		ДокументОбъект.Дата 		= ТекущаяДатаСеанса();	
	КонецЕсли;
	ДокументОбъект.Организация 	= РеквизитыЦессии.Организация; 
	ДокументОбъект.Валюта		= РеквизитыЦессии.ВалютаДокумента;
	ДокументОбъект.Комментарий 	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Регл учет по документу: %1'"), Цессия);
	ДокументОбъект.Ответственный= Пользователи.ТекущийПользователь();   
	
	Если ЭтоДоход Тогда 
		ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочиеДоходы; 	
	Иначе
		ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочиеРасходы; 
	КонецЕсли;	      
	ДокументОбъект.ПрочиеДоходы.Очистить();
	ДокументОбъект.ПрочиеРасходы.Очистить();
	
	Если ЭтоДоход Тогда 
		СтрокаОперации = ДокументОбъект.ПрочиеДоходы.Добавить();
		СтрокаОперации.СтатьяДоходов = Константы.СтатьяДоходовЦессии.Получить();
	Иначе	
		СтрокаОперации = ДокументОбъект.ПрочиеРасходы.Добавить();	           
		СтрокаОперации.СтатьяРасходов = Константы.СтатьяРасходовЦессии.Получить();
	КонецЕсли;	
	
	СтрокаОперации.СтатьяАктивовПассивов 	= Константы.СтатьяОтраженияЦессии.Получить();
	СтрокаОперации.Сумма 			= СуммаПремии;
	СтрокаОперации.СуммаРегл 		= СуммаПремии;
	СтрокаОперации.Подразделение	= РеквизитыЦессии.Подразделение;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	ПрочиеДоходыРасходыЦедент = ДокументОбъект.Ссылка;
	ЗаписатьОтражениеЦессийВРегламентированномУчете(ДокументОбъект.Ссылка);
   
КонецПроцедуры

&НаСервере
Процедура СоздатьПрочиеДоходыРасходыЦедентЗаем()

	СтруктураРеквизитов = ЦессииУХ.РеквизитыЦедент(); 
		
	РеквизитыЦессии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Цессия, СтруктураРеквизитов);
	
    СуммаПремии 	= РеквизитыЦессии.СуммаДокумента - РеквизитыЦессии.СуммаОбязательства;
	ЭтоДоход 		= СуммаПремии>0;   
	Если НЕ  ЭтоДоход Тогда
	    СуммаПремии	= - СуммаПремии;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПрочиеДоходыРасходыЦедентЗаем) Тогда
    	ДокументОбъект 				= ПрочиеДоходыРасходыЦедентЗаем.ПолучитьОбъект();
	Иначе
		ДокументОбъект 				= Документы.ПрочиеДоходыРасходы.СоздатьДокумент();	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Дата ) Тогда
		ДокументОбъект.Дата 		= ТекущаяДатаСеанса();	
	КонецЕсли;
	ДокументОбъект.Организация 	= РеквизитыЦессии.Организация; 
	ДокументОбъект.Валюта		= РеквизитыЦессии.ВалютаДокумента;
	ДокументОбъект.Комментарий 	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Регл учет по документу: %1'"), Цессия);
	ДокументОбъект.Ответственный= Пользователи.ТекущийПользователь();
	Если ЭтоДоход Тогда 
		ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочиеДоходы; 	
	Иначе
		ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочиеРасходы; 
	КонецЕсли;	      
	ДокументОбъект.ПрочиеДоходы.Очистить();
	ДокументОбъект.ПрочиеРасходы.Очистить();
	
	Если ЭтоДоход Тогда 
		СтрокаОперации = ДокументОбъект.ПрочиеДоходы.Добавить();
		СтрокаОперации.СтатьяДоходов = Константы.СтатьяДоходовЦессии.Получить();
	Иначе	
		СтрокаОперации = ДокументОбъект.ПрочиеРасходы.Добавить();	           
		СтрокаОперации.СтатьяРасходов = Константы.СтатьяРасходовЦессии.Получить();
	КонецЕсли;	
	
	СтрокаОперации.СтатьяАктивовПассивов 	= Константы.СтатьяОтраженияЦессии.Получить();
	СтрокаОперации.Сумма 			= СуммаПремии;
	СтрокаОперации.СуммаРегл 		= СуммаПремии;
	СтрокаОперации.Подразделение	= РеквизитыЦессии.Подразделение;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	ПрочиеДоходыРасходыЦедентЗаем = ДокументОбъект.Ссылка;
	ЗаписатьОтражениеЦессийВРегламентированномУчете(ДокументОбъект.Ссылка);
   
КонецПроцедуры

&НаСервере
Процедура СоздатьКорректировкаФИЦедент()

	СтруктураРеквизитов = ЦессииУХ.РеквизитыЦедент();

	РеквизитыЦессии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Цессия, СтруктураРеквизитов);
	
	Если ЗначениеЗаполнено(КорректировкаЦедентФИ) Тогда
		ДокументОбъект 			= КорректировкаЦедентФИ.ПолучитьОбъект();	
	Иначе
		ДокументОбъект 			= Документы.КорректировкаЗадолженностиПоФинансовымИнструментам.СоздатьДокумент();		
	КонецЕсли;
	
	ДокументОбъект.Организация 	= РеквизитыЦессии.Организация; 
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Дата) Тогда
		ДокументОбъект.Дата 		= ТекущаяДатаСеанса();         
	КонецЕсли;	
	ДокументОбъект.Автор 	= Пользователи.ТекущийПользователь();
	ДокументОбъект.Комментарий 	= СтрШаблон(НСтр("ru = 'Регл учет по документу: %1'"), Цессия);
	
	ДокументОбъект.Организация 	= РеквизитыЦессии.Организация; 
	ДокументОбъект.Комментарий 	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Регл учет по документу: %1'"), Цессия);
	ДокументОбъект.Автор		= Пользователи.ТекущийПользователь();
	ДокументОбъект.Договор		= РеквизитыЦессии.ДоговорДолжника;
	ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности;
	ДокументОбъект.ХарактерДоговора		 = Перечисления.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм;
	ДокументОбъект.Контрагент 	= РеквизитыЦессии.Должник;
	ДокументОбъект.Партнер	 	= РеквизитыЦессии.ПартнерДолжник;
	ДокументОбъект.СтатьяДоходов = Константы.СтатьяОтраженияЦессии.Получить();

	
	ДокументОбъект.Задолженность.Очистить();
	СтрокаЗадолженности  = ДокументОбъект.Задолженность.Добавить();
	СтрокаЗадолженности.ТипСуммы 	= Перечисления.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг;
	СтрокаЗадолженности.Сумма 		= РеквизитыЦессии.СуммаОбязательства;

	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КорректировкаЦедентФИ = ДокументОбъект.Ссылка;
	ЗаписатьОтражениеЦессийВРегламентированномУчете(ДокументОбъект.Ссылка);

КонецПроцедуры

&НаСервере
Функция СуммаОсновногоДолгаЦессии()
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= 
		"ВЫБРАТЬ
		|	СУММА(ЦессияИсходящаяТекущаяЗадолженность.Сумма) КАК Сумма
		|ИЗ
		|	Документ.ЦессияИсходящая.ТекущаяЗадолженность КАК ЦессияИсходящаяТекущаяЗадолженность
		|ГДЕ
		|	ЦессияИсходящаяТекущаяЗадолженность.ЭлементСтруктурыЗадолженности <> &ЭлементСтруктурыЗадолженности
		|	И ЦессияИсходящаяТекущаяЗадолженность.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", 						Цессия);
	Запрос.УстановитьПараметр("ЭлементСтруктурыЗадолженности", 	Перечисления.ЭлементыСтруктурыЗадолженности.Проценты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Итог = 0 ;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Итог = ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;                             
	
	Возврат Итог;

КонецФункции // ()

&НаСервере
Функция СуммаОсновногоДолгаЦессииДолжника()
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= 
		"ВЫБРАТЬ
		|	СУММА(ЦессияДолжника.Сумма) КАК Сумма
		|ИЗ
		|	Документ.ЦессияДолжника.ТекущаяЗадолженность КАК ЦессияДолжника
		|ГДЕ
		|	ЦессияДолжника.ЭлементСтруктурыЗадолженности <> &ЭлементСтруктурыЗадолженности
		|	И ЦессияДолжника.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", 						Цессия);
	Запрос.УстановитьПараметр("ЭлементСтруктурыЗадолженности", 	Перечисления.ЭлементыСтруктурыЗадолженности.Проценты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Итог = 0 ;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Итог = ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;                             
	
	Возврат Итог;

КонецФункции // ()

&НаСервере
Процедура ПерезаполнитьНаСервере()
	
	Если ЭтоДолжник	И ЗначениеЗаполнено(КорректировкаДолжник) Тогда
		СоздатьКорректировкуДолгаДолжник();
	КонецЕсли;    
	Если ЭтоДолжник	И ЗначениеЗаполнено(КорректировкаДолжникФИКредит) Тогда
		СоздатьКорректировкаДолжникФИКредит();
	КонецЕсли; 
	Если ЭтоДолжник	И ЗначениеЗаполнено(КорректировкаДолжникФИДебет) Тогда
		СоздатьКорректировкаДолжникФИДебет();
	КонецЕсли; 

	Если ЭтоЦессионарий	И ЗначениеЗаполнено(ПоступлениеЦессионарий) Тогда
		СоздатьПоступлениеЦессионарий();
	КонецЕсли;    
	
	Если ЭтоЦессионарий	И ЗначениеЗаполнено(КорректировкаЦессионарийФИ) Тогда
		СоздатьКорректировкаЗадолженностиФИЦессионарий();
	КонецЕсли;  
		
	Если ЭтоЦессионарий	И ЗначениеЗаполнено(ЗаписьКнигиПродажЦессионарийПоставка) Тогда
		СоздатьЗаписьКнигиПродажЦессионарийПоставка();
	КонецЕсли; 

	Если ЭтоЦессионарий	И ЗначениеЗаполнено(ЗаписьКнигиПродажЦессионарийЗаем) Тогда
		СоздатьЗаписьКнигиПродажЦессионарийЗаем();
	КонецЕсли; 
	
	Если ЭтоЦессионарий	И ЗначениеЗаполнено(ПрочиеДоходыРасходыЦессионарий) Тогда
		СоздатьПрочиеДоходыРасходыЦессионарий();
	КонецЕсли;      
	
	Если ЭтоЦессионарий	И ЗначениеЗаполнено(ПрочиеДоходыРасходыЦессионарий) Тогда
		СоздатьПрочиеДоходыРасходыЦессионарийЗаем();
	КонецЕсли;      
	
	// Цедент 
	Если ЭтоЦедент И ЗначениеЗаполнено(ПрочиеДоходыРасходыЦедент) Тогда
		СоздатьПрочиеДоходыРасходыЦедент();
	КонецЕсли;

	Если ЭтоЦедент И ЗначениеЗаполнено(ПрочиеДоходыРасходыЦедентЗаем) Тогда
		СоздатьПрочиеДоходыРасходыЦедентЗаем();
	КонецЕсли;
	
	Если ЭтоЦедент	И ЗначениеЗаполнено(КорректировкаЗадолженности) Тогда
		СоздатьКорректировкаЗадолженностиЦедент();
	КонецЕсли;        
		
	Если ЭтоЦедент	И ЗначениеЗаполнено(КорректировкаЦедентФИ) Тогда
		СоздатьКорректировкаФИЦедент();
	КонецЕсли; 
	
	Если ЭтоЦедент	И ЗначениеЗаполнено(РеализацияЦедент) Тогда
		СоздатьРеализацияЦедент();
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура СоздатьКорректировкаДолжникФИДебет()
	
	СтруктураРеквизитов = ЦессииУХ.РеквизитыДолжник();
	РеквизитыЦессии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Цессия, СтруктураРеквизитов);
	
	СуммаОсновногоДолга = СуммаОсновногоДолгаЦессииДолжника();
    СуммаПроцентов 		= РеквизитыЦессии.СуммаДокумента - СуммаОсновногоДолга;

	Если ЗначениеЗаполнено(КорректировкаДолжникФИДебет) Тогда
    	ДокументОбъект 			= КорректировкаДолжникФИДебет.ПолучитьОбъект();
	Иначе
		ДокументОбъект 			= Документы .КорректировкаЗадолженностиПоФинансовымИнструментам.СоздатьДокумент();	
	КонецЕсли;
	ДокументОбъект.Организация 	= РеквизитыЦессии.Организация; 
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Дата) Тогда 
		ДокументОбъект.Дата 		= ТекущаяДатаСеанса();
	КонецЕсли;	
	ДокументОбъект.Комментарий 	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Регл учет по документу: %1'"), Цессия);
	ДокументОбъект.Автор		= Пользователи.ТекущийПользователь();
	ДокументОбъект.Договор		= РеквизитыЦессии.ДоговорСЦедентом;
	ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности; 
	ДокументОбъект.ХарактерДоговора			= Перечисления.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм; 
	ДокументОбъект.Контрагент 	= РеквизитыЦессии.Цессионарий;
	ДокументОбъект.Партнер	 	= РеквизитыЦессии.ПартнерЦессионарий;   
	ДокументОбъект.СтатьяРасходов = Константы.СтатьяОтраженияЦессии.Получить();
	
	ДокументОбъект.Задолженность.Очистить();
	СтрокаЗадолженности = ДокументОбъект.Задолженность.Добавить();
	СтрокаЗадолженности.ТипСуммы 	= Перечисления.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг;
	СтрокаЗадолженности.Сумма 		= РеквизитыЦессии.СуммаДокумента;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);   
	КорректировкаДолжникФИДебет = ДокументОбъект.Ссылка;
	ЗаписатьОтражениеЦессийВРегламентированномУчете(ДокументОбъект.Ссылка);

КонецПроцедуры	

&НаСервере
Процедура СоздатьПрочиеДоходыРасходыЦессионарий()
		
	СтруктураРеквизитов = ЦессииУХ.РеквизитыЦессионарий(); 
	РеквизитыЦессии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Цессия, СтруктураРеквизитов);
	
    СуммаПремии 	= РеквизитыЦессии.СуммаДокумента - РеквизитыЦессии.СуммаОбязательства;
	ЭтоДоход 		= СуммаПремии>0;   
	Если НЕ  ЭтоДоход Тогда
	    СуммаПремии	= - СуммаПремии;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПрочиеДоходыРасходыЦессионарий) Тогда
    	ДокументОбъект 				= ПрочиеДоходыРасходыЦессионарий.ПолучитьОбъект();
	Иначе
		ДокументОбъект 				= Документы.ПрочиеДоходыРасходы.СоздатьДокумент();	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Дата ) Тогда
		ДокументОбъект.Дата 		= ТекущаяДатаСеанса();	
	КонецЕсли;
	ДокументОбъект.Организация 	= РеквизитыЦессии.Организация; 
	ДокументОбъект.Валюта		= РеквизитыЦессии.ВалютаДокумента;
	ДокументОбъект.Комментарий 	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Регл учет по документу: %1'"), Цессия);
	ДокументОбъект.Ответственный= Пользователи.ТекущийПользователь();
	Если ЭтоДоход Тогда 
		ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочиеДоходы; 	
	Иначе
		ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочиеРасходы; 
	КонецЕсли;	      
	ДокументОбъект.ПрочиеДоходы.Очистить();
	ДокументОбъект.ПрочиеРасходы.Очистить();
	
	Если ЭтоДоход Тогда 
		СтрокаОперации = ДокументОбъект.ПрочиеДоходы.Добавить();
		СтрокаОперации.СтатьяДоходов = Константы.СтатьяДоходовЦессии.Получить();
	Иначе	
		СтрокаОперации = ДокументОбъект.ПрочиеРасходы.Добавить();	           
		СтрокаОперации.СтатьяРасходов = Константы.СтатьяРасходовЦессии.Получить();
	КонецЕсли;	
	
	СтрокаОперации.СтатьяАктивовПассивов 	= Константы.СтатьяОтраженияЦессии.Получить();
	СтрокаОперации.Сумма 			= СуммаПремии;
	СтрокаОперации.Подразделение 	= РеквизитыЦессии.Подразделение;
	СтрокаОперации.СуммаРегл 		= СуммаПремии;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение); 
	ПрочиеДоходыРасходыЦессионарий = ДокументОбъект.Ссылка;
	ЗаписатьОтражениеЦессийВРегламентированномУчете(ДокументОбъект.Ссылка);
   
КонецПроцедуры

&НаСервере
Процедура СоздатьКорректировкаЗадолженностиФИЦессионарий()
		
	СтруктураРеквизитов = ЦессииУХ.РеквизитыЦессионарий(); 
	
	РеквизитыЦессии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Цессия, СтруктураРеквизитов);
	
	Если ЗначениеЗаполнено(КорректировкаЦессионарийФИ) Тогда
    	ДокументОбъект 				= КорректировкаЦессионарийФИ.ПолучитьОбъект();
	Иначе
		ДокументОбъект 				= Документы.КорректировкаЗадолженностиПоФинансовымИнструментам.СоздатьДокумент();	
	КонецЕсли;
	ДокументОбъект.Организация 	= РеквизитыЦессии.Организация; 
	Если Не ЗначениеЗаполнено(ДокументОбъект.Дата) Тогда
		ДокументОбъект.Дата 		= ТекущаяДатаСеанса();
	КонецЕсли;
	
	ДокументОбъект.Комментарий 	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Регл учет по документу: %1'"), Цессия);
	ДокументОбъект.Автор		= Пользователи.ТекущийПользователь();
	ДокументОбъект.Договор		= РеквизитыЦессии.ДоговорДолжника;
	ДокументОбъект.Контрагент	= РеквизитыЦессии.Должник;
	ДокументОбъект.Партнер		= РеквизитыЦессии.ПартнерДолжника;
	ДокументОбъект.ХарактерДоговора 		= Перечисления.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм;
	ДокументОбъект.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности;
	ДокументОбъект.СтатьяРасходов 			= Константы.СтатьяРасходовЦессии.Получить();
	
	ДокументОбъект.Задолженность.Очистить();
	СтрокаЗадолженности = ДокументОбъект.Задолженность.Добавить();
	СтрокаЗадолженности.ТипСуммы 	= Перечисления.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг;
	СтрокаЗадолженности.Сумма 		= РеквизитыЦессии.СуммаОбязательства;
		
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);   
	КорректировкаЦессионарийФИ = ДокументОбъект.Ссылка;
	ЗаписатьОтражениеЦессийВРегламентированномУчете(ДокументОбъект.Ссылка);
   
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьКнигиПродажЦессионарийПоставка()
	
	СтруктураРеквизитов = ЦессииУХ.РеквизитыЦессионарий();
	РеквизитыЦессии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Цессия, СтруктураРеквизитов);
	
	СуммаПремии = РеквизитыЦессии.СуммаДокумента - РеквизитыЦессии.СуммаОбязательства;
	Если СуммаПремии <= 0 Тогда
		Возврат;	
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗаписьКнигиПродажЦессионарийПоставка) Тогда
    	ДокументОбъект 				= ЗаписьКнигиПродажЦессионарийПоставка.ПолучитьОбъект();
	Иначе
		ДокументОбъект 				= Документы.ЗаписьКнигиПродаж.СоздатьДокумент();	
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДокументОбъект.Дата) Тогда
		ДокументОбъект.Дата 		= ТекущаяДатаСеанса();
	КонецЕсли;
	ДокументОбъект.Организация 	= РеквизитыЦессии.Организация; 
	ДокументОбъект.Комментарий 	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Регл учет по документу: %1'"), Цессия);
	ДокументОбъект.ХозяйственнаяОперация		= Перечисления.ХозяйственныеОперации.ПрочееНачислениеНДС;
	ДокументОбъект.Валюта		= РеквизитыЦессии.ВалютаДокумента;
	ДокументОбъект.СуммаДокумента = СуммаПремии; 
	ДокументОбъект.Контрагент	= РеквизитыЦессии.Контрагент;
	
	ДокументОбъект.Ценности.Очистить();
	СтрокаЦенности = ДокументОбъект.Ценности.Добавить();
	СтрокаЦенности.ВидЦенности 	= Перечисления.ВидыЦенностей.ПрочиеРаботыИУслуги;
	СтрокаЦенности.Событие		= Перечисления.СобытияПоНДСПродажи.Оплата;
	СтрокаЦенности.Количество 	= 1;          
	СтрокаЦенности.Цена 		= СуммаПремии;
	СтрокаЦенности.Сумма 		= СуммаПремии;
	СтрокаЦенности.СуммаНДС		= РеквизитыЦессии.СуммаНДС;
	СтрокаЦенности.СтавкаНДС	= РеквизитыЦессии.СтавкаНДС;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);  
	ЗаписьКнигиПродажЦессионарийПоставка = ДокументОбъект.Ссылка;
	ЗаписатьОтражениеЦессийВРегламентированномУчете(ДокументОбъект.Ссылка);
		
КонецПроцедуры

&НаСервере
Процедура СоздатьПоступлениеЦессионарий()   
	
	СтруктураРеквизитов = ЦессииУХ.РеквизитыЦессионарий();
	РеквизитыЦессии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Цессия, СтруктураРеквизитов);

	Если ЗначениеЗаполнено(ПоступлениеЦессионарий) Тогда
		ДокументОбъект = ПоступлениеЦессионарий.ПолучитьОбъект();
	Иначе
		ДокументОбъект = Документы.ПриобретениеУслугПрочихАктивов.СоздатьДокумент();		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Дата) Тогда
		ДокументОбъект.Дата			= ТекущаяДатаСеанса();
	КонецЕсли;                                     
	
    ДокументОбъект.Валюта			 	= РеквизитыЦессии.ВалютаДокумента;
	ДокументОбъект.ВалютаВзаиморасчетов	= РеквизитыЦессии.ВалютаДокумента;
	
	ДокументОбъект.Организация 		= РеквизитыЦессии.Организация;
	ДокументОбъект.Контрагент 		= РеквизитыЦессии.Контрагент;
	ДокументОбъект.Партнер 			= РеквизитыЦессии.Партнер;
	ДокументОбъект.Договор		 	= РеквизитыЦессии.ДоговорЦессии;  
	
	ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	ДокументОбъект.ПорядокРасчетов	 	=  РеквизитыЦессии.ПорядокРасчетов;
	ДокументОбъект.КурсЧислитель				 = 1;
	ДокументОбъект.КурсЗнаменатель				 = 1;
	ДокументОбъект.Автор						 = Пользователи.ТекущийПользователь();
	ДокументОбъект.НалогообложениеНДС		= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	ДокументОбъект.ЗакупкаПодДеятельность 	= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	
	ДокументОбъект.Расходы.Очистить();
	
	НоваяСтрока = ДокументОбъект.Расходы.Добавить(); 
	НоваяСтрока.Содержание  	= НСтр("ru = 'Регл учет по документу'");
	НоваяСтрока.Количество		= 1;
	НоваяСтрока.СтавкаНДС		= РеквизитыЦессии.СтавкаНДС;
	НоваяСтрока.Цена			= РеквизитыЦессии.СуммаДокумента;	
	НоваяСтрока.Сумма			= РеквизитыЦессии.СуммаДокумента;
	НоваяСтрока.СуммаСНДС		= РеквизитыЦессии.СуммаДокумента;
	НоваяСтрока.Подразделение	= РеквизитыЦессии.Подразделение;
	НоваяСтрока.СтатьяРасходов	= Константы.СтатьяОтраженияЦессии.Получить();
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);  
	
	ПоступлениеЦессионарий	= ДокументОбъект.Ссылка;
	ЗаписатьОтражениеЦессийВРегламентированномУчете(ДокументОбъект.Ссылка)

КонецПроцедуры

&НаСервере
Процедура СоздатьПоступлениеЦессионарийЗаем()   
	
	СтруктураРеквизитов = ЦессииУх.РеквизитыЦессионарий();

	РеквизитыЦессии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Цессия, СтруктураРеквизитов);
	Если ЗначениеЗаполнено(ПоступлениеЦессионарийЗаем) Тогда
		ДокументОбъект = ПоступлениеЦессионарийЗаем.ПолучитьОбъект();
	Иначе
		ДокументОбъект = Документы.ПриобретениеУслугПрочихАктивов.СоздатьДокумент();		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Дата) Тогда
		ДокументОбъект.Дата			= ТекущаяДатаСеанса();
	КонецЕсли;                                     
	
    ДокументОбъект.Валюта			 	= РеквизитыЦессии.ВалютаДокумента;
	ДокументОбъект.ВалютаВзаиморасчетов	= РеквизитыЦессии.ВалютаДокумента;
	
	ДокументОбъект.Организация 		= РеквизитыЦессии.Организация;
	ДокументОбъект.Контрагент 		= РеквизитыЦессии.Контрагент;
	ДокументОбъект.Партнер 			= РеквизитыЦессии.Партнер;
	ДокументОбъект.Договор		 	= РеквизитыЦессии.ДоговорЦессии; 
	ДокументОбъект.НалогообложениеНДС		= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	ДокументОбъект.ЗакупкаПодДеятельность 	= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	
	ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	ДокументОбъект.ПорядокРасчетов	 	=  РеквизитыЦессии.ПорядокРасчетов;
	ДокументОбъект.КурсЧислитель				 = 1;
	ДокументОбъект.КурсЗнаменатель				 = 1;
	ДокументОбъект.Автор						 = Пользователи.ТекущийПользователь();
	
	ДокументОбъект.Расходы.Очистить();
	
	НоваяСтрока = ДокументОбъект.Расходы.Добавить(); 
	
	НоваяСтрока.Содержание  	= НСтр("ru = 'Регл учет по документу'"); 
	НоваяСтрока.Подразделение	= РеквизитыЦессии.Подразделение;
	НоваяСтрока.Количество		= 1;
	НоваяСтрока.СтавкаНДС		= Справочники.СтавкиНДС.БезНДС;
	НоваяСтрока.Цена			= РеквизитыЦессии.СуммаДокумента;	
	НоваяСтрока.Сумма			= РеквизитыЦессии.СуммаДокумента;
	НоваяСтрока.СуммаСНДС		= РеквизитыЦессии.СуммаДокумента; 

	
	НоваяСтрока.СтатьяРасходов	= Константы.СтатьяОтраженияЦессии.Получить();
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);  
	
	ПоступлениеЦессионарийЗаем	= ДокументОбъект.Ссылка;
	ЗаписатьОтражениеЦессийВРегламентированномУчете(ДокументОбъект.Ссылка)

КонецПроцедуры

&НаСервере
Процедура СоздатьРеализацияЦедент()
	СтруктураРеквизитов = ЦессииУХ.РеквизитыЦедент();
	РеквизитыЦессии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Цессия, СтруктураРеквизитов);
	
	Если ЗначениеЗаполнено(РеализацияЦедент) Тогда
        ДокументОбъект = РеализацияЦедент.ПолучитьОбъект();
	Иначе
		ДокументОбъект = Документы.РеализацияУслугПрочихАктивов.СоздатьДокумент();		
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Дата) Тогда
		ДокументОбъект.Дата			= ТекущаяДатаСеанса();
	КонецЕсли;
	ДокументОбъект.Автор 			= Пользователи.ТекущийПользователь(); 
	ДокументОбъект.Контрагент		= РеквизитыЦессии.Контрагент;
	ДокументОбъект.Партнер			= РеквизитыЦессии.Партнер;
	ДокументОбъект.Договор			= РеквизитыЦессии.ДоговорЦессии;
	ДокументОбъект.Соглашение		= РеквизитыЦессии.Соглашение;
	ДокументОбъект.Организация		= РеквизитыЦессии.Организация;             
	ДокументОбъект.ВалютаВзаиморасчетов = РеквизитыЦессии.ВалютаДокумента;
	ДокументОбъект.Валюта				= РеквизитыЦессии.ВалютаДокумента;
	ДокументОбъект.ХозяйственнаяОперация= Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
	ДокументОбъект.Подразделение		= РеквизитыЦессии.Подразделение; 
	ДокументОбъект.НалогообложениеНДС	= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		
	ДокументОбъект.Доходы.Очистить();
	СтрокаЗадолженности = ДокументОбъект.Доходы.Добавить();
	СтрокаЗадолженности.Содержание		= НСтр("ru = 'Задолженность по договору займа'");
	СтрокаЗадолженности.Количество		= 1;
	СтрокаЗадолженности.Цена			= РеквизитыЦессии.СуммаОбязательства;
	СтрокаЗадолженности.Сумма			= РеквизитыЦессии.СуммаОбязательства; 
	СтрокаЗадолженности.СтатьяДоходов	= Константы.СтатьяДоходовЦессии.Получить();
	СтрокаЗадолженности.СтавкаНДС		= Справочники.СтавкиНДС.БезНДС;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);  

	РеализацияЦедент	= ДокументОбъект.Ссылка;
	ЗаписатьОтражениеЦессийВРегламентированномУчете(ДокументОбъект.Ссылка)
    
КонецПроцедуры

&НаСервере
Процедура СоздатьПрочиеДоходыРасходыЦессионарийЗаем()

	СтруктураРеквизитов = ЦессииУХ.РеквизитыЦессионарий(); 
	РеквизитыЦессии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Цессия, СтруктураРеквизитов);
	
    СуммаПремии 	= РеквизитыЦессии.СуммаДокумента - РеквизитыЦессии.СуммаОбязательства;
	ЭтоДоход 		= СуммаПремии>0;   
	Если НЕ  ЭтоДоход Тогда
	    СуммаПремии	= - СуммаПремии;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПрочиеДоходыРасходыЦессионарийЗаем) Тогда
    	ДокументОбъект 				= ПрочиеДоходыРасходыЦессионарийЗаем.ПолучитьОбъект();
	Иначе
		ДокументОбъект 				= Документы.ПрочиеДоходыРасходы.СоздатьДокумент();	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Дата ) Тогда
		ДокументОбъект.Дата 		= ТекущаяДатаСеанса();	
	КонецЕсли;
	ДокументОбъект.Организация 	= РеквизитыЦессии.Организация; 
	ДокументОбъект.Валюта		= РеквизитыЦессии.ВалютаДокумента;
	ДокументОбъект.Комментарий 	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Регл учет по документу: %1'"), Цессия);
	ДокументОбъект.Ответственный= Пользователи.ТекущийПользователь();
	Если ЭтоДоход Тогда 
		ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочиеДоходы; 	
	Иначе
		ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочиеРасходы; 
	КонецЕсли;	      
	ДокументОбъект.ПрочиеДоходы.Очистить();
	ДокументОбъект.ПрочиеРасходы.Очистить();
	
	Если ЭтоДоход Тогда 
		СтрокаОперации = ДокументОбъект.ПрочиеДоходы.Добавить();
		СтрокаОперации.СтатьяДоходов = Константы.СтатьяДоходовЦессии.Получить();
		СтрокаОперации.Подразделение  = РеквизитыЦессии.Подразделение;
	Иначе	
		СтрокаОперации = ДокументОбъект.ПрочиеРасходы.Добавить();	           
		СтрокаОперации.СтатьяРасходов = Константы.СтатьяРасходовЦессии.Получить();  
		СтрокаОперации.Подразделение	= РеквизитыЦессии.Подразделение;
	КонецЕсли;	
	
	СтрокаОперации.СтатьяАктивовПассивов 	= Константы.СтатьяОтраженияЦессии.Получить();
	СтрокаОперации.Сумма 			= СуммаПремии;
	СтрокаОперации.СуммаРегл 		= СуммаПремии;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение); 
	ПрочиеДоходыРасходыЦессионарийЗаем = ДокументОбъект.Ссылка;
	ЗаписатьОтражениеЦессийВРегламентированномУчете(ДокументОбъект.Ссылка);
   

КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьКнигиПродажЦессионарийЗаем()
	
	СтруктураРеквизитов = ЦессииУХ.РеквизитыЦессионарий();
	РеквизитыЦессии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Цессия, СтруктураРеквизитов);
	
	СуммаПремии = РеквизитыЦессии.СуммаДокумента - РеквизитыЦессии.СуммаОбязательства;
	Если СуммаПремии <= 0 Тогда
		Возврат;	
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗаписьКнигиПродажЦессионарийЗаем) Тогда
    	ДокументОбъект 				= ЗаписьКнигиПродажЦессионарийЗаем.ПолучитьОбъект();
	Иначе
		ДокументОбъект 				= Документы.ЗаписьКнигиПродаж.СоздатьДокумент();	
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДокументОбъект.Дата) Тогда
		ДокументОбъект.Дата 		= ТекущаяДатаСеанса();
	КонецЕсли;
	ДокументОбъект.Организация 	= РеквизитыЦессии.Организация; 
	ДокументОбъект.Комментарий 	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Регл учет по документу: %1'"), Цессия);
	ДокументОбъект.ХозяйственнаяОперация		= Перечисления.ХозяйственныеОперации.ПрочееНачислениеНДС;
	ДокументОбъект.Валюта		= РеквизитыЦессии.ВалютаДокумента;
	ДокументОбъект.СуммаДокумента = СуммаПремии; 
	ДокументОбъект.Контрагент	= РеквизитыЦессии.Контрагент;
	ДокументОбъект.Подразделение  = РеквизитыЦессии.Подразделение;
	
	ДокументОбъект.Ценности.Очистить();
	СтрокаЦенности = ДокументОбъект.Ценности.Добавить();
	СтрокаЦенности.ВидЦенности 	= Перечисления.ВидыЦенностей.ПрочиеРаботыИУслуги;
	СтрокаЦенности.Событие		= Перечисления.СобытияПоНДСПродажи.Оплата;
	СтрокаЦенности.Количество 	= 1;          
	СтрокаЦенности.Цена 		= СуммаПремии;
	СтрокаЦенности.Сумма 		= СуммаПремии;
	СтрокаЦенности.СуммаНДС		= РеквизитыЦессии.СуммаНДС;
	СтрокаЦенности.СтавкаНДС	= РеквизитыЦессии.СтавкаНДС;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);  
	ЗаписьКнигиПродажЦессионарийЗаем = ДокументОбъект.Ссылка;
	ЗаписатьОтражениеЦессийВРегламентированномУчете(ДокументОбъект.Ссылка);
	
КонецПроцедуры


#КонецОбласти
